app/views/convocations/template_pdf.pdf.erb

        <h3 class="text-center"><strong>Detalles Adicionales</strong></h3>
        <% if not @convocation.dependences.blank? %>
---
SELECT "dependences".* FROM "dependences" INNER JOIN "convocation_dependences" ON "dependences"."id" = "convocation_dependences"."dependence_id" WHERE "convocation_dependences"."convocation_id" = ?  [["convocation_id", 1]]


        <% if not @convocation.requirements.blank? %>
---
SELECT "requirements".* FROM "requirements" WHERE "requirements"."convocation_id" = ?  [["convocation_id", 1]]


        <% if not @convocation.required_files.blank? %>
---
SELECT "required_files".* FROM "required_files" WHERE "required_files"."convocation_id" = ?  [["convocation_id", 1]]


        <% if not @convocation.profiles.blank? %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."convocation_id" = ?  [["convocation_id", 1]]


        <% if not @convocation.activities.blank? %>
---
SELECT "activities".* FROM "activities" WHERE "activities"."convocation_id" = ?  [["convocation_id", 1]]