app/controllers/admins_controller.rb

  def create

    @admin = Admin.new(admin_params)

    if @admin.save
---
INSERT INTO "admins" ("name", "lastname", "permits", "phone_ext", "dependence_id", "created_at", "updated_at", "email", "encrypted_password") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)