app/controllers/convocations_controller.rb

INSERT INTO "convocations" ("name", "description", "level", "end_date", "admin_id", "vacants", "hours_per_week", "payout", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @convocation = Convocation.new(convocation_params)

    if @convocation.save

SELECT COUNT(*) FROM "convocations"
---
  def search
    aux_array = []
    self_params = search_params
    out_object = {}
    if self_params[:dependence]
      aux_array.push(self_params[:dependence])
    else
      aux_array.push(current_user.dependence_id)
    end
    self_params[:dependences] = aux_array
    out_object[:pages] = (Convocation.count / 10).floor

SELECT  "convocations".* FROM "convocations" WHERE "convocations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_convocation
      @convocation = Convocation.find(params[:id])