app/controllers/dependences_controller.rb

SELECT "dependences".* FROM "dependences"
---
  def index
    @dependences = Dependence.all