app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "lastname", "level", "created_at", "updated_at", "email", "encrypted_password", "dependence_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "lastname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lastname", "Cuellar Garcia"], ["updated_at", "2018-04-20 07:37:15.801350"], ["id", 1]]